# 식탁보 개인정보처리방침

## 개인 정보 정책

마지막으로 수정한 날짜: 2022년 3월 30일

이 개인 정보 보호 정책은 귀하가 서비스를 사용할 때 귀하의 정보를 수집, 사용 및 공개하는 것에 대한 개발자의 정책 및 절차를 설명하고 귀하의 개인 정보 보호 권리와 법이 귀하를 보호하는 방법을 알려줍니다.

개발자는 서비스 자체를 제공하고 개선하기 위해 귀하의 익명의 비 개인 데이터와 서비스의 건강 및 성능 데이터를 사용합니다. 서비스를 사용함으로써 귀하는 본 개인정보 보호정책에 따라 정보를 수집하고 사용하는 데 동의합니다.

## 정의

이 개인정보처리방침 문서에 사용되는 용어의 정의는 다음과 같습니다.

- **귀하**: 서비스에 액세스하거나 이를 사용하는 개인, 해당하는 경우 해당 개인이 서비스에 액세스하거나 서비스를 사용하는 회사 또는 기타 법인을 의미합니다.
- **개발자:** 식탁보 소프트웨어를 개발하고 관리하는 사람을 나타냅니다.
- **웹 사이트**: 식탁보 소프트웨어에 관한 정보를 얻을 수 있는 홈페이지 ([https://github.com/yourtablecloth/tablecloth](https://github.com/yourtablecloth/tablecloth))를 나타냅니다.
- **서비스**: 식탁보 소프트웨어를 나타냅니다.
- **국가**: 대한민국을 나타냅니다.
- **서비스 제공자**: 개발자를 대신하여 데이터를 처리하는 모든 자연인 또는 법인을 의미합니다. 서비스를 용이하게 하고, 개발자를 대신하여 서비스를 제공하고, 서비스와 관련된 서비스를 수행하거나, 서비스 사용 방법을 분석하는 데 있어 개발자를 지원하는 제3자 개발자 또는 개인 기여자를 말합니다.
- **개인 데이터**: 식별되거나 식별 가능한 개인과 관련된 모든 정보입니다.
- **비 개인 데이터**: 식별되거나 식별 가능한 개인과 관련이 없는 모든 정보입니다.
- **기기**: 컴퓨터, 휴대전화 또는 디지털 태블릿과 같이 서비스에 액세스할 수 있는 모든 기기를 의미합니다.
- **사용 데이터**: 서비스 사용에 의해 생성되거나 서비스 인프라 자체에서 자동으로 수집되는 데이터를 말합니다. (예: 서비스를 시작하는 데 걸리는 시간)

## 개인 데이터 수집 및 사용

### 수집된 데이터 유형

#### 개인 정보

개발자가 만든 서비스가 제공하는 공동 인증서와 관련된 일부 기능에서 개인 데이터를 귀하에게 요청할 수 있습니다. 그러나 개인 데이터는 서비스를 사용하는 동안에만 한시적으로 활용합니다. 기능 수행 목적을 달성한 후에는 지체없이 파기됩니다.

이 서비스가 귀하에게 요청할 수 있는 개인 데이터의 종류는 다음과 같습니다.

- 기존 공동인증서 파일 가져오기 옵션을 사용하기 위해 필요한 공동 인증서의 공개 키 파일과 비밀 키 파일의 쌍, 혹은 PKCS #12 인증서 파일
- PKCS #12 인증서를 ASN.1 DER 형식으로 변환하기 위해 필요한 인증서 비밀 번호

#### 사용 데이터

사용 데이터는 서비스를 사용할 때 자동으로 수집됩니다. 사용 데이터에는 오류 메시지, 성능 메트릭, 서비스 사용 중에 사용된 기능의 목록과 같이 개인을 식별할 수 없는 정보가 포함될 수 있습니다. 사용 데이터는 개발자 및 서비스 제공자에게 전송되지 않습니다.

귀하가 원할 경우 사용 데이터는 서비스 설정 페이지에서 전송을 허용하거나 거부할 수 있습니다.

## 다른 웹사이트에 대한 링크

개발자가 만든 서비스에는 개발자가 운영하지 않는 다른 웹사이트에 대한 링크가 포함될 수 있습니다. 타사 링크를 클릭하면 해당 타사 사이트로 이동합니다. 방문하는 모든 사이트의 개인정보 보호정책을 검토할 것을 강력히 권장합니다.

개발자는 제 3자 사이트 또는 서비스의 콘텐츠, 개인정보 보호정책 또는 관행을 통제하지 않으며 책임을 지지 않습니다.

## 제 3자 서비스

개발자가 만든 서비스를 통해 귀하는 제3자 서비스를 사용할 수 있습니다. 사용하는 모든 서비스의 개인정보 보호정책을 검토할 것을 강력히 권장합니다.

개발자는 제3자 서비스의 콘텐츠, 개인정보 보호정책 또는 관행을 통제하지 않으며 책임을 지지 않습니다.

## 개인 정보 보호 정책의 변경 사항

개발자는 개인정보 보호정책을 수시로 업데이트할 수 있습니다. 변경 사항이 있는 경우 이 페이지에 새로운 개인정보 보호정책을 게시하여 알려드립니다. 변경 사항이 있는지 정기적으로 이 개인 정보 보호 정책을 검토하는 것이 좋습니다. 이 개인 정보 보호 정책에 대한 변경 사항은 이 페이지에 게시될 때 유효합니다.

## 문의하기

이 개인 정보 보호 정책에 대해 질문이 있는 경우 다음 연락처로 문의할 수 있습니다.

- rkttu@rkttu.com
